# Redis事务



## 简介

Redis事务本质：一组命令的集合! 一个事务中素有的命令都会被序列化，在事务执行过程中会按照顺序执行！一次性、排他性、顺序性执行一些列的命令

`------队列 set set set 执行-------`

- Redis单条命令是原子性的，但事务不保证原子性!
- Redis事务没有隔离级别的概念
- 所有的命令在事务中，并没有直接被执行！只有发起执行命令的时候才会执行!Exec

- 执行流程

  - 开启事务（multi）
  - 命令入队（）
  - 执行事务（exec）

  

- 每次执行完之后事务结束，下次执行前需重新开启事务

## DEMO

```bash
ali:0>multi # 开启事务
"OK"
ali:0>set k1 v1
"QUEUED"
ali:0>set k2 v2
"QUEUED"
ali:0>get k2
"QUEUED"
ali:0>set k3 v3
"QUEUED"
ali:0>exec # 执行 事务结束
1) "OK"
2) "OK"
3) "OK"
4) "OK"
5) "OK"
6) "v2"
7) "OK"
8) "OK"
9) "OK"

################################################
ali:0>multi # 
"OK"
ali:0>set k1 v1 
"QUEUED"
ali:0>set k2 v2
"QUEUED"
ali:0>set k3 v3
"QUEUED"
ali:0>discard # 放弃事务，事务队列中的命令都不会被执行
"OK"
ali:0>get k4
null
#########################################################
# 事务队列中有语法错误（命令错误，编译时异常），所有的命令都不会执行
ali:0>multi
"OK"
ali:0>set k1 v1
"QUEUED"
ali:0>set k2 v2
"QUEUED"
ali:0>getset k3 # 错误的命令
"ERR wrong number of arguments for 'getset' command"
ali:0>set k4 v4
"QUEUED"
ali:0>exec # 执行事务报错
"EXECABORT Transaction discarded because of previous errors."
ali:0>get k1 # 所有的命令都不会执行
null

########################################################
# 如果队列中有执行错误（语法正确），其他命令可以正常执行，错误命令抛出异常
ali:0>set k1 v1
"OK"
ali:0>multi
"OK"
ali:0>incr k1 # 将会执行错误 v1为字符串，不能自增
"QUEUED"
ali:0>set k2 v2
"QUEUED"
ali:0>set k3 v3
"QUEUED"
ali:0>get k3
"QUEUED"
ali:0>exec
1) "OK"
2) "ERR value is not an integer or out of range" # 虽然第一条命令报错了，但是依旧正常执行成功了
3) "OK"
4) "OK"
5) "OK"
6) "OK"
7) "OK"
8) "v3"
9) "OK"
ali:0>get k2 # 其他命令执行成功
"v2"
ali:0>get k1
"v1"
```



## 监控

`watch`

### 悲观锁

- 认为什么时候都会有问题，无论什么时候都加锁

### 乐观锁

- 认为什么时候都不会粗线问题，所以不上锁，更新数据的时候去判断一下，在此期间是否有人修改过这个数据
- 获取version
- 更新的时候比较version

> Redis监视测试

正常执行成功

```bash
ali:0>set money 100 # 余额
"OK"
ali:0>set out 0 # 支出
"OK"
ali:0>watch money # 监视money对象
"OK"
ali:0>multi  # 事务正常结束，数据期间没有发生变动
"OK"
ali:0>decrby money 20
"QUEUED"
ali:0>incrby out 20
"QUEUED"
ali:0>exec
1) "OK"
2) "80"
3) "OK"
4) "20"
5) "OK"
```

测试多线程修改值，使用watch可以当作redis的乐观锁操作

```bash
ali:0>watch money # 监视 money
"OK"
ali:0>multi
"OK"
ali:0>decrby money 10
"QUEUED"
ali:0>incrby out 10
"QUEUED"
ali:0>exec # 执行之前另外一个线程修改了money的值，这个时候事务执行失败

ali:0>get money
"1000"
```

exec之前另一个线程执行的操作

```bash
ali:0>get money
"80"
ali:0>set money 1000
"OK"
```

